/* Создайте класс CSS, у которого будет статический метод rgb(r,g,b).Метод должен возвращать строку в формате "rgb(23,56,100)". r,g,b должны быть  целыми числами  от 0 до 255(включая).
Например, вызов CSS.rgb(23, 56, 100) должен вернуть 'rgb(23,56,100)'.
А вызов CSS.rgb(323, -56, 36.6) должен вернуть 'rgb(255,0,37)' */
class CSS {
    static rgb(...c) {
        c = c.map(n => (n < 0 ? 0 : n > 255 ? 255 : Math.round(n)));
        let [r, g, b] = c;
        return `rgb(${r},${g},${b})`; //return `rgb(${c.join(',')})`;
    }
}
console.log(CSS.rgb(23, 56, 100)); //rgb(23,56,100)
console.log(CSS.rgb(323, -56, 36.6)); //rgb(255,0,37)